
import random

독맥_1 = {
    "요양관": "L4",
    "명문": "L2",
    "현추": "L1",
    "척중": "T11",
    "중추": "T10",
    "근축": "T9",
    "지양": "T7",
    "영대": "T6",
    "신도": "T5",
    "신주": "T3",
    "도도": "T1",
    "대추": "C7"
}

독맥_2 = {
    "L4": "요양관",
    "L2": "명문",
    "L1": "현추",
    "T11": "척중",
    "T10": "중추",
    "T9": "근축",
    "T7": "지양",
    "T6": "영대",
    "T5": "신도",
    "T3": "신주",
    "T1": "도도",
    "C7": "대추"
}

임맥_1 = {
    "곡골": -5.0,
    "중극": -4.0,
    "관원": -3.0,
    "석문": -2.0,
    "기해": -1.5,
    "음교": -1.0,
    "신궐": 0.0,
    "수분": 1.0,
    "하완": 2.0,
    "건리": 3.0,
    "중완": 4.0,
    "상완": 5.0,
    "거궐": 6.0,
    "구미": 7.0,
    "중정": 8.0 # 칼몸통결합
}

임맥_2 = {
    -5: "곡골",
    -4: "중극",
    -3: "관원",
    -2: "석문",
    -1.5: "기해",
    -1: "음교",
    0: "신궐",
    1: "수분",
    2: "하완",
    3: "건리",
    4: "중완",
    5: "상완",
    6: "거궐",
    7: "구미",
    8: "중정" # 칼몸통결합
}

오원 = {
    "폐": {
        "정": "소상", "형": "어제", "수": "태연", "경": "경거", "합": "척택",
        "원": "태연", "락": "열결", "극": "공최", "모": "중부", "배수": "폐수"
    },
    "대장": {
        "정": "상양", "형": "이간", "수": "삼간", "경": "양계", "합": "곡지",
        "원": "합곡", "락": "편력", "극": "온류", "모": "천추", "배수": "대장수"
    },
    "위": {
        "정": "여태", "형": "내정", "수": "함곡", "경": "해계", "합": "족삼리",
        "원": "충양", "락": "풍륭", "극": "양구", "모": "중완", "배수": "위수"
    },
    "비": {
        "정": "은백", "형": "대도", "수": "태백", "경": "상구", "합": "음릉천",
        "원": "태백", "락": "공손, 대포", "극": "지기", "모": "장문", "배수": "비수"
    },
    "비": {
        "정": "은백", "형": "대도", "수": "태백", "경": "상구", "합": "음릉천",
        "원": "태백", "락": "공손, 대포", "극": "지기", "모": "장문", "배수": "비수"
    },
    "소장": {
        "정": "소택", "경": "전곡", "수": "후계", "경": "양곡", "합": "소해",
        "원": "완골", "락": "지정", "극": "양로", "모": "관원", "배수": "소장수"
    },
    "방광": {
        "정": "지음", "경": "족통곡", "수": "속골", "경": "곤륜", "합": "위중",
        "원": "경골", "락": "비양", "극": "금문", "모": "중극", "배수": "방광수"
    },
    "신": {
        "정": "용천", "경": "연곡", "수": "태계", "경": "부류", "합": "음곡",
        "원": "태계", "락": "대종", "극": "수천", "모": "경문", "배수": "신수"
    },
    "심포": {
        "정": "중충", "경": "노궁", "수": "대릉", "경": "간사", "합": "곡택",
        "원": "대릉", "락": "내관", "극": "극문", "모": "단중", "배수": "궐음수"
    },
    "삼초": {
        "정": "관충", "경": "액문", "수": "중저", "경": "지구", "합": "천정",
        "원": "양지", "락": "외관", "극": "회종", "모": "석문", "배수": "삼초수"
    },
    "담": {
        "정": "족규음", "경": "협계", "수": "족임읍", "경": "양보", "합": "양릉천",
        "원": "구허", "락": "광명", "극": "외구", "모": "일월", "배수": "담수"
    },
    "간": {
        "정": "대돈", "경": "행간", "수": "태충", "경": "중봉", "합": "곡천",
        "원": "태충", "락": "여구", "극": "중도", "모": "기문", "배수": "간수"
    }
}


print('\n★★ 경혈학 수시 대비 퀴즈모음 ★★')

while True:
    
    퀴즈선택 = input('\n1. 독맥 \n2. 임맥 \n3. 오수혈-원락극모수\n\n1~3 중 하나를 입력하여 퀴즈를 선택하세요 > ')
    
    if 퀴즈선택 == '1':
        
        cease = False
        wrong = False
        while not cease:
            
            while True:
                
                if not wrong:
                    f = random.choice((0, 1))
                    q = [독맥_1, 독맥_2][f]
                    c = random.choice(list(q.keys()))
                    정답 = q[c]
                
                if f:
                    print(f"\n{c} 가시돌기 아래 오목한 곳에 위치하는 혈자리는?")
                else:
                    print(f"\n{c}혈은 어느 vertebra의 가시돌기 아래 오목한 곳에 위치하는가?")
                
                답안 = input('\n답안 한글로 입력 > ') if f else input('\nex) L3, T10, C7\n위와 같이 답안 기호로 입력 > ')
                if 답안 == 'X' or 답안 == 'x' or 답안 == 'ㅌ':
                    cease = True
                    break
                
                elif 답안 == '':
                    continue
                
                elif 답안 == 정답:
                    wrong = False
                    print('\n★★ 정답★★\n\n뒤로 돌아가려면 X를 입력하세요~')
                    break
                
                else:
                    print('\n오답')
                    wrong = True
                    continue
        
        continue
    
    elif 퀴즈선택 == '2':
    
        cease = False
        wrong = False
        while not cease:
            
            while True:
                
                if not wrong:
                    f = random.choice((0, 1))
                    q = [임맥_1, 임맥_2][f]
                    c = random.choice(list(q.keys()))
                    정답 = q[c]
                
                if f:
                    print(f"\n배꼽으로부터 sup. 방향으로 {c}寸 떨어진 혈자리는?")
                    print("※ 배꼽 아래에 위치하면 음수로 표시.\n※ 칼몸통결합은 +8촌에 위치함.")
                else:
                    print(f"\n{c}혈은 배꼽으로부터 sup.방향으로 몇 촌 떨어진 곳에 위치하는가?"
                    print("※ 배꼽 아래에 위치하면 음수로 입력.\n※ 칼몸통결합은 +8촌에 위치함.")
                
                try:
                    답안 = input('\n답안 한글로 입력 > ') if f else input('\nex) 0, +1.5, -2\n위와 같이 답안 숫자로 입력 > ')
                    if 답안 == 'X' or 답안 == 'x' or 답안 == 'ㅌ':
                        cease = True
                        break
                    if not f:
                        답안 = float(답안)
                except ValueError:
                    continue
                
                if 답안 == '':
                    continue
                
                elif 답안 == 정답:
                    wrong = False
                    print('\n★★ 정답★★\n\n뒤로 돌아가려면 X를 입력하세요~')
                    break
                
                else:
                    wrong = True
                    print('\n오답')
                    continue
        
        continue
    
    elif 퀴즈선택 == '3':
        
        cease = False
        while not cease:
            
            c = random.choice(list(오원.keys()))
            d = 오원[c]
            e = random.choice(list(d.keys()))
            정답 = d[e]
            
            print(f"\n{c}경의 {e}혈은?")
            while True:
                답안 = input('\n답안 한글로 입력 > ')
                
                if 답안 == '':
                    continue
                
                elif len(정담) > 3 and 답안 in 정답 or len(정담) < 4 and 답안 == 정답:
                    print('\n★★ 정답★★\n\n뒤로 돌아가려면 X를 입력하세요~')
                    break
                
                elif 답안 == 'X' or 답안 == 'x' or 답안 == 'ㅌ':
                    cease = True
                    break
                
                else:
                    print('\n오답')
                    continue
        
        continue
    
    else:    
        continue
