
import random

print('\n☆☆ 내경편 권2 목차 순서 퀴즈 ☆☆\n')

while True:

    L = [
    ['陰血生於水穀', '血爲榮', '血爲氣配', '脉法', '熱能傷血', '七情動血', '內傷失血', '失血諸證', '辨血色新舊', '蓄血證', '血病吉凶', '亡血脫血證', '衄血', '嘔血吐血', '咳血嗽血唾血咯血', '尿血', '便血', '腸澼證', '齒衄', '舌衄', '血汗', '九竅出血', '傷損失血', '失血眩暈', '黑藥止血', '禁忌', '治血藥法', '通治血病藥餌', '單方', '鍼灸法'],
    ['魂魄爲夢', '淫邪發夢', '五藏虛實爲夢', '陽氣之出入爲窹寐', '昏沈多睡', '虛煩不睡', '老少之睡不同', '睡辨陰陽虛實', '臥不安', '身重嗜臥', '惡人欲獨處', '寢睡法', '辟惡夢', '用藥法', '單方', '鍼灸法'],
    ['聲音出於腎', '聽聲音辨病證', '卒然無音', '因雜病失音', '厥氣爲瘖', '瘖瘂有二', '聲嘶', '腎怯與失音相似', '息有音', '不治證', '傷寒狐惑聲瘂', '小兒疳痢聲瘂', '通治聲音藥', '單方', '鍼灸法'],
    ['肺主聲爲言', '言語譫妄', '瘖不得語', '痰塞亡血亦爲瘖', '脉法', '鄭聲', '言微', '呼', '笑', '歌', '哭', '呻', '欠', '嚏', '噫', '太息', '大驚不語', '中風不語', '語澁皆屬風', '婦人産前不語産後不語', '小兒語遲', '言語法', '不治證', '鍼灸法'],
    ['身中津液', '腎主液', '脉法', '汗因濕熱', '自汗', '盜汗', '頭汗', '心汗', '手足汗', '陰汗', '血汗', '黃汗', '漏風證', '亡陽證', '止汗法', '無汗', '絶汗', '柔汗', '汗出凶證', '禁忌', '積氣生液', '泣', '涕', '涎', '唾', '迴津法', '通治藥', '單方', '鍼灸法'],
    ['痰涎飮三者不同', '痰飮分淸濁', '王隱君痰論', '飮病有八', '痰病有十', '脉法', '痰飮外證', '痰飮諸病', '辨痰色', '痰飮流注證', '痰病有似邪祟', '痰厥', '痰塊', '喜唾痰', '痰結', '痰病不卒死', '痰病難治證', '痰飮吐法', '痰飮治法', '痰飮通治藥', '單方', '鍼灸法']]

    order = [
    [[0, 1, 3, 2, 4], [0, 2, 1, 3, 4], [0, 2, 3, 1, 4], [0, 3, 1, 2, 4], [0, 3, 2, 1, 4]],
    [[0, 1, 2, 4, 3], [0, 1, 4, 2, 3], [0, 2, 1, 4, 3], [0, 2, 4, 1, 3]],
    [[1, 0, 2, 3, 4], [1, 0, 3, 2, 4], [1, 2, 0, 3, 4], [1, 3, 0, 2, 4]]]

    c6 = random.randrange(0, 6)
    cx = random.randrange(0, len(L[c6]) - 4)

    선지 = []
    정답 = []
    for i in range(5):
        정답.append(L[c6][cx + i])
    선지.append(정답)

    c2a = random.randrange(1, 3)
    for i in range(c2a):
        
        오답 = []
        x = random.randrange(0, 5 - i)
        for j in range(5):
            오답.append(정답[order[0][x][j]])
            
        선지.append(오답)
        del order[0][x]

    c2b = random.randrange(1, 3)
    for i in range(4 - c2a):
        
        오답 = []
        x = random.randrange(0, 4 - i)
        for j in range(5):
            오답.append(정답[order[c2b][x][j]])
        
        선지.append(오답)
        del order[c2b][x]

    random.shuffle(선지)

    for i in range(5):
        print(선지[i])

    while True:
        답안 = input('\n순서가 옳은 것을 고르시오 (1 ~ 5) : ')
        
        if 답안 == '':
            continue
        
        elif 49 <= ord(str(답안)) < 54:
            if 선지[int(답안) - 1] == 정답:
                print('\n정답\n')
                break
            
            else:
                print('\n오답')
                continue
        
        else:
            print('\n오답')
            continue
    
    continue