
import random

six=[
    ['正月','陽氣出在上','陽氣凍解','陽氣萬物盛上而躍','三陽生','天氣尙寒','陰氣尙盛','陰氣尙盛'],
    ['五月','盛陽之陰','陽者 衰於五月','與陽始爭','盛陽 一陰爻生 卽是陽中之陰','與陽交爭','一陰氣上 陽氣降下','陽盛而陰氣加之'],
    ['盛(戌)','心之所表','九月','陽氣盡而陰氣盛','物藏則不動','萬物盡衰','陰氣外盛 故萬物之氣 極畢墮落','陰氣方盛 主於藏物','萬物草木 盡皆衰落','萬物盡衰 草木畢落'],
    ['十月','萬物陰陽不定','秋氣始至 微霜始下','方殺萬物','七月','陽氣初奪','萬物少衰 未至枯落 故未得畢去','始凉未寒','孟冬','萬物之陽氣皆傷'],
    ['十一月','萬物氣 皆藏於中','陰氣下衰 而陽氣且出','陰氣內聚 陽氣外通','氣微未能外通','有五陰爻','陰中之至陰','藏而不瀉','冬至候'],
    ['三月','陰氣將盡','陽中之陰','陰氣一在而盛','一振 榮華萬物','五陽一陰','一振 陽氣振','餘寒尙在']
]

name=['태음','양명','소양','소음','태음','궐음']

while 1:
    r=random.randrange(6)
    t=six[r]
    z=random.randrange(len(t))
    print('')
    print(t[z])
    while 1:
        e=int(input('태음 양명 소양 소음 태음 궐음 中 > '))-1
        if e==r:
            print('ㅇㅇ')
            break
        else:
            print('ㄴㄴ')
