import random

print('\n☆☆목차 순서 퀴즈 ☆☆\n')

while True:

    L = [
    ['小便原委', '脬爲尿器', '辨尿色', '脉法', '小便難外候', '小便不利', '小便不通', '轉脬證', '關格證', '難治不治證', '小便不禁', '諸淋證', '淋病有五', '淋病有八', '諸淋通治', '赤白濁', '蠱病白淫', '脬痺證', '莖中痒痛', '交腸證', '小便多寡', '飮後卽小便', '單方', '鍼灸法'],
    ['大便原委', '大便病因', '辨便色', '脉法', '泄證有五', '泄瀉諸證', '泄瀉宜用升陽之藥', '瀉與痢不同', '久泄成痢', '痢疾諸證', '八痢危證', '痢疾腹痛', '痢疾裏急後重', '痢疾大孔痛', '痢疾宜下', '治痢要訣', '痢疾通治藥', '泄痢易治難治辨', '泄痢吉凶證', '飯後隨卽大便', '大便秘結', '老人秘結', '脾約證', '大便不通', '大小便不通', '罨臍法', '導便法', '單方', '鍼灸法'],
    ['頭爲天谷以藏神', '頭有九宮', '腦爲髓海', '頭部度數', '頭病外候', '脉法', '頭風證', '眩暈', '頭目不淸利', '正頭痛', '偏頭痛', '風寒頭痛', '濕熱頭痛', '厥逆頭痛', '痰厥頭痛', '氣厥頭痛', '熱厥頭痛', '濕厥頭痛', '眞頭痛', '醉後頭痛', '頭痛當分六經', '腦風證', '首風證', '眉稜骨痛', '頭痛不治難治證', '風頭旋', '腦縫開裂', '頭生白屑', '㗜鼻法', '吐法', '下法', '單方', '鍼灸法'],
    ['明堂部位', '面爲諸陽之會', '人面耐寒', '面病專屬胃', '面部度數', '面熱', '面寒', '面見五色', '面戴陽證', '胃風證', '腎風證', '搭顋腫', '面上雜病', '按摩法', '面部凶證', '單方']]

    order = [
    [[0, 1, 3, 2, 4], [0, 2, 1, 3, 4], [0, 2, 3, 1, 4], [0, 3, 1, 2, 4], [0, 3, 2, 1, 4]],
    [[0, 1, 2, 4, 3], [0, 1, 4, 2, 3], [0, 2, 1, 4, 3], [0, 2, 4, 1, 3]],
    [[1, 0, 2, 3, 4], [1, 0, 3, 2, 4], [1, 2, 0, 3, 4], [1, 3, 0, 2, 4]]]

    c6 = random.randrange(0, 4)
    cx = random.randrange(0, len(L[c6]) - 4)

    선지 = []
    정답 = []
    for i in range(5):
        정답.append(L[c6][cx + i])
    선지.append(정답)

    c2a = random.randrange(1, 3)
    for i in range(c2a):
        
        오답 = []
        x = random.randrange(0, 5 - i)
        for j in range(5):
            오답.append(정답[order[0][x][j]])
            
        선지.append(오답)
        del order[0][x]

    c2b = random.randrange(1, 3)
    for i in range(4 - c2a):
        
        오답 = []
        x = random.randrange(0, 4 - i)
        for j in range(5):
            오답.append(정답[order[c2b][x][j]])
        
        선지.append(오답)
        del order[c2b][x]

    random.shuffle(선지)

    for i in range(5):
        print(선지[i])

    while True:
        답안 = input('\n순서가 옳은 것을 고르시오 (1 ~ 5) : ')
        
        if 답안 == '':
            continue
        
        elif len(답안) == 1:
            if 49 <= ord(str(답안)) < 54:
                if 선지[int(답안) - 1] == 정답:
                    print('\n정답\n')
                    break
                
                else:
                    print('\n오답')
                    continue
            
            else:
                print('\n오답')
                continue
        
        else:
            print('\n오답')
            continue
    
    continue
