import random
l=[
['草玆', '翠羽', '縞裹紺', '蒼璧之澤', '藍', '面靑', '善潔', '善怒', '臍左有動氣', '按之牢若痛', '肢滿閉', '淋溲便難', '轉筋'],
['衃血', '鷄冠', '縞裹朱', '帛朱', '赭', '面赤', '口乾', '喜笑', '臍上有動氣', '按之牢若痛', '煩心', '心痛', '掌中熱而啘'],
['枳實', '蟹服', '縞裹括蔞實', '羅裹雄黃', '黃土', '面黃', '善噫', '善思', '善味', '臍有動氣', '按之牢若痛', '腹脹滿', '食不消', '體重節痛', '怠惰嗜臥', '四肢不收'],
['枯骨', '豕膏', '縞裹紅', '鵝羽', '鹽', '面白', '善嚔', '悲愁不樂', '欲哭', '臍右有動氣', '按之牢若痛', '喘咳', '洒淅寒熱'],
['炱者', '烏羽', '縞裹紫', '重漆色', '地蒼', '面黑', '善恐欠', '臍下有動氣', '按之牢若痛', '病逆氣', '小腹急痛', '泄如下重', '足脛寒而逆']
]
while 1:
    i=random.randrange(5)
    print(random.choice(l[i]))
    print('①靑 ②赤 ③黃 ④白 ⑤黑 중 어느 색에 해당?')
    print('1 ~ 5 중 입력')
    while 1:
        n=int(input())
        if n-1==i:
            print('ㅇㅇ\n')
            break
        else:
            print('ㄴㄴ')
            continue
