
l = [
    ['소상', '어제', '태연', '경거', '척택', '태연', '열결', '공최', '중부', '폐수'],
    ['상양', '이간', '삼간', '양계', '곡지', '합곡', '편력', '온류', '천추', '대장수'],
    ['여태', '내정', '함곡', '해계', '족삼리', '충양', '풍륭', '양구', '중완', '위수'],
    ['은백', '대도', '태백', '상구', '음릉천', '태백', '공손', '지기', '장문', '비수'],
    ['소충', '소부', '신문', '영도', '소해', '신문', '통리', '음극', '거궐', '심수'],
    ['소택', '전곡', '후계', '양곡', '소해', '완골', '지정', '양로', '관원', '소장수'],
    ['지음', '족통곡', '속골', '곤륜', '위중', '경골', '비양', '금문', '중극', '봥광수'],
    ['용천', '연곡', '태계', '부류', '음곡', '태계', '대종', '수천', '경문', '신수'],
    ['중충', '노궁', '대릉', '간사', '곡택', '대릉', '내관', '극문', '단중', '궐음수'],
    ['관충', '액문', '중저', '지구', '천정', '양지', '외관', '회종', '석문', '삼초수'],
    ['족규음', '협계', '족임읍', '양보', '양릉천', '구허', '광명', '외구', '일월', '담수'],
    ['대돈', '행간', '태충', '충봉', '곡천', '태충', '여구', '중도', '기문', '간수']
]

score = [0 for _ in range(120)]

while sum(score) < 120:
    for i in range(12):
        s = input()
        ans = s.split()
        for j in range(10):
            if ans[j] == l[i][j]:
                score[10*i + j] = 1
            else:
                score[10*i + j] = 0
        print(f"score = {sum(score)} / 120")
