
import random

print('\n★★ 한의학원론I 중간고사 대비 퀴즈모음 ★★')

while True:
    
    퀴즈선택 = input('\n1. 오행귀류표\n2. 기의 분류\n3. 기의 기능\n4. 신의 분류\n5. 정서의 분류\n\n1~5를 입력하여 퀴즈를 선택하세요> ')
    
    if 퀴즈선택 == '1':
        
        cease = 'no'
        while cease == 'no':
            
            구분 = ['五臟', '六腑', '五季', '五方', '五色', '五情', '五味', '五氣', '五藏', '五官', '五聲', '五臭', '五主', '五液']

            정답 = [
            '肝心脾肺腎',
            '膽小腸胃大腸膀胱',
            '春夏長夏秋冬',
            '東南中央西北',
            '靑赤黃白黑',
            '怒喜思憂悲恐敬',
            '酸苦甘辛鹹',
            '風暑濕燥寒',
            '魂神意魄志',
            '目舌口鼻耳',
            '呼笑歌哭呻',
            '臊焦香腥腐',
            '筋脈肉皮骨',
            '淚汗涎涕唾']

            c = random.randrange(0, 14)

            print('\n' + 구분[c] + '에 해당하는 것을 木火土金水의 순으로 쓰시오.')
            print('(한자를 이어 쓰거나, 쉼표 또는 스페이스로 구분할 수 있습니다.)')

            while True:
                
                답안 = str(input('\n답안 입력 : '))
                ch = ' ,'
                답안 = ''.join(i for i in 답안 if i not in ch)
                
                if 답안 == '':
                    continue
                
                elif 답안 == 정답[c]:
                    print('\n정답\n\n뒤로 돌아가려면 X를 입력하세요')
                    break
                
                elif 답안 == 'X' or 답안 == 'x' or 답안 == 'ㅌ':
                    cease = 'yes'
                    break
                
                else:
                    print('\n오답')
                    continue
        
        continue
    
    elif 퀴즈선택 == '2':
        
        cease = 'no'
        while cease == 'no':
        
            정답 = ['元氣', '元氣', '宗氣', '宗氣', '營氣', '營氣', '衛氣', '衛氣', '天氣', '天氣']

            원문 = [
            '人之未生 則此氣蘊於父母 是爲先天之',
            '無器不有 無所不至. 血因此而行 氣因此而生',
            '五臟六腑十二經脈之宗始',
            '胃腑水穀之所生  積于胸中',
            '水穀之精氣也. 和調於五臟 灑陳於六腑. 乃能入於脈也 故循脈上下 貫五臟絡六腑也',
            '在脈中 衛在脈外. 營周不休 五十度而復大會 陰陽相貫 如環無端',
            '水穀之悍氣也. 其氣慓疾滑利 不能入於脈也. 故循皮膚之中 分肉之間 熏於肓膜 散于胸腹',
            '衛外而爲固也. 虛則腠理疎 而邪氣直入於內 故爲暴病卒死',
            '肺主氣 而司呼吸開闔',
            '吐者 出故氣 亦名死氣 納者 取新氣 亦名生氣']

            c = random.randrange(0, 10)
            
            print('\n' + 원문[c])
            print('위 원문이 설명하는 氣의 분류를 한자로 쓰시오.')

            while True:
                답안 = str(input('\n답안 입력 : '))
                
                if 답안 == '':
                    continue
                
                elif 답안 == 정답[c]:
                    print('\n정답\n\n뒤로 돌아가려면 X를 입력하세요')
                    break
                
                elif 답안 == 'X' or 답안 == 'x' or 답안 == 'ㅌ':
                    cease = 'yes'
                    break
                
                else:
                    print('\n오답')
                    continue
        
        continue
    
    elif 퀴즈선택 == '3':
        
        cease = 'no'
        while cease == 'no':
            
            원문 = [
            '氣爲血之帥 血隨之而運行',
            '汗隨氣 而宣發於外',
            '陽氣若天與日 失其所則折壽而不彰…… 人之陽氣 猶天之日光 人失陽氣 則壽命易折 猶天失光明 則萬物無以發生也',
            '寒暑過度 生乃不固',
            '人之眞氣 煦噓往來 熏蒸於皮膚分肉間也',
            '正氣存內 邪不可干',
            '邪之所湊 其氣必虛',
            '衛氣者 衛外而爲固也. 衛氣虛則腠理疎 而邪氣直入於內 故爲暴病卒死',
            '脫肛全是氣下陷',
            '自汗侵侵屬氣虛',
            '夢泄者 腎氣虛而下脫',
            '精能生氣 氣能生神',
            '精氣津液血脈 無非氣之所化也',
            '營者 水穀之精氣也. 和調於五臟 灑陳於六腑 乃能入於脈也 故循脈上下 貫五臟絡六腑也',
            '營氣者 泌其津液 注之於脈 化以爲血 以營四末 內注五臟六腑']

            c = random.randrange(0, 15)

            if 0 <= c < 3:
                정답 = '推動'

            elif 3 <= c < 5:
                정답 = '溫煦'

            elif 5 <= c < 8:
                정답 = '防禦'

            elif 8 <= c < 11:
                정답 = '固攝'

            elif 11 <= c < 13:
                정답 = '氣化'
            
            else:
                정답 = '營養'

            print('\n' + 원문[c])
            print('위 원문이 설명하는 氣의 기능을 두 개의 한자로 쓰시오.')

            while True:
                답안 = str(input('\n답안 입력 : '))
                
                if 답안 == '':
                    continue
                
                elif 답안 == 정답:
                    print('\n정답\n\n뒤로 돌아가려면 X를 입력하세요')
                    break
                
                elif 답안 == 'X' or 답안 == 'x' or 답안 == 'ㅌ':
                    cease = 'yes'
                    break
                
                else:
                    print('\n오답')
                    continue
        
        continue
    
    elif 퀴즈선택 == '4':
        
        cease = 'no'
        while cease == 'no':
        
            정답 = ['魂', '魂', '神', '意', '意', '魄', '魄', '志', '志']

            원문 = [
            '如夢寐恍惚 變幻遊行之境 皆是也',
            '運用動作底是○…… 陽主運用 故○能發用出來',
            '蓋○之爲德 如光明爽朗聰慧靈通之類',
            '心有所憶',
            '憶 思憶也. 謂一念之生 心有所嚮 而未定者',
            '痛痒由之而覺也',
            '不運用動作底是○ ○盛則耳目聰明能記憶 老人目昏耳聵記事不得者 ○衰也…… 陰主藏受 故○能記憶在內',
            '意之所存',
            '意之所存 謂意已決而卓 有所立者']

            c = random.randrange(0, 9)
            
            print('\n' + 원문[c])
            print('위 원문이 설명하는 神의 분류를 한자로 쓰시오.')

            while True:
                답안 = str(input('\n답안 입력 : '))
                
                if 답안 == '':
                    continue
                
                elif 답안 == 정답[c]:
                    print('\n정답\n\n뒤로 돌아가려면 X를 입력하세요')
                    break
                
                elif 답안 == 'X' or 답안 == 'x' or 답안 == 'ㅌ':
                    cease = 'yes'
                    break
                
                else:
                    print('\n오답')
                    continue
        
        continue
    
    elif 퀴즈선택 == '5':
        
        cease = 'no'
        while cease == 'no':
        
            정답 = ['怒', '喜', '喜', '思', '憂悲', '憂悲', '恐敬', '恐敬', '恐敬', '恐敬']

            원문 = [
            '肝氣不舒則善○',
            '○發於心 樂散在外',
            '升于九天之上 神氣暢達 是以喜生',
            '因志而存變 謂意志雖定 而復有反覆計度者',
            '金氣慘悽 故令人○',
            '氣之方降 而未降則○',
            '○者爲自不知也 ○者爲自知也',
            '盖○者聞響乃○',
            '○者 自知 如人將捕之狀 及不能獨自坐臥 必須人爲伴侶方不○懼 或夜必用燈照 無燈燭亦○懼者',
            '氣之方降 而未降則悲 已降則爲○. 蓋陷于重淵之下 志意幽淪 是以○作']

            c = random.randrange(0, 10)
            
            print('\n' + 원문[c])
            print('위 원문이 설명하는 神의 분류를 한자로 쓰시오.')

            while True:
                답안 = str(input('\n답안 입력 : '))
                
                if 답안 == '':
                    continue
                
                elif 답안 == 정답[c]:
                    print('\n정답\n\n뒤로 돌아가려면 X를 입력하세요')
                    break
                
                elif 답안 == 'X' or 답안 == 'x' or 답안 == 'ㅌ':
                    cease = 'yes'
                    break
                
                else:
                    print('\n오답')
                    continue
        
        continue
    
    else:
    
        continue