

import random


l=[['(黃帝, 岐伯)', '黃帝內經', '王氷 제목 확정, 도교 영향, 西漢 완성, 高麗 판본→영추, 평소강구문답설, 全元起 최초 註解'], ['秦越人?', '難經', '張仲景 최초 거론, 脈學 내용 많음, 문답체제, 촌구진맥법 보편화, 기경팔맥 토론,'], ['華佗', '華氏中藏經', '외손 자칭 인물이 화타 著 주장-아닌듯, 장부 내용 시초 다룸, 마불산, 오금희,'], ['淳于意', '診籍', '사마천이 후에 편작창공열전에 실음, 最古의 醫案'], ['?', '治百病方', '52病方 - 상한잡병론 과도기 것, 서한시대 임상의학 대 표, 駱酥 白羊矢'], ['?', '神農本草經', '후한 이후 作, 원서 유실, 약물 365종, 三品분류법, 약물 성능 인식, 상호배합, 君臣佐使, 用藥, 服藥'], ['張仲景', '傷寒雜病論', '方劑學 공헌: 처방약물112 사용약물214, 완전한 組方원칙(君臣佐使), 八法, 六經病, 王叔和가 정리'], ['巢元方', '巢氏病源', '諸病源候論, 질병을 67門으로 나눔, 1729종의 症候 논술'], ['王叔和', '脈經', '24脈狀및 병변, 촌관척 삼부맥과 장부 관계 규정, 맥진 방법 고정시킴'], ['高陽生', '脈訣', '맥경의 정리본,  脈訣出而脈經隱, 24맥상을 三類로 나누어 논란'], ['葛洪', '肘後備急方', '當代 最古 외과의서, 응급처방, 침법 사용 X'], ['王燾', '外臺秘要', '唐의 거대 종합성 의학저작, 총 40권 1104문, 선집한 각서 모두 출처 밝힘'], ['皇甫謐', '甲乙經', '풀네임 黃帝三部鍼灸甲乙經, 여러 삼부서 모음, 漢代 침구 진보: 兪穴 상세히'], ['孫思邈', '備急千金要方', '간칭 千金方, 중국 최초 임상 백과전서, 부인소아 중시, 전서 232문, 方論 5300首, 5장6부11문 귀입'], ['楊上善', '黃帝內經明堂類成', ' 관찬 본초서, 본초경집주 기초 위 114종 추가, 당대 최고 본초서'], ['陶弘景', '本草經集注', '신농본초경의 365종을 700여 종으로 증보'], ['蘇敬', '新修本草', '當代 약물 수 증가 보임'], ['陳藏器', '本草拾遺', '當代 약물 수 증가 보임, 十劑設'], ['雷斅', '雷公炮炙論', '약물의 性味, 炮炙, 修治 등 이론과 방법 논함'], ['王氷', '王氷注素問', '왕빙이 오운육기 이론 보입함'], ['褚澄?', '褚氏遺書', '인체를 竅 肢 關 餘 附 五體로 나눔, 남녀는 촌관척 삼부 좌우상하 장부반응 모두 상반됨'], ['韓保昇', '蜀本草', '신수본초 기본, 증보 註解 더함, 약물 형태, 산지 관한 내용 그림 추가'], ['관서', '太平聖惠方', '방제 위주 종합의서, 소씨병원 위주 인용, 의학 문헌 보존 의의'], ['관서', '太平惠民和劑局方', '21門 297首, 증보 후 14門 788方, 진한가열 불문하고 기성처방 풍조 생김, 우황청심원'], ['관서', '政和聖濟總錄', '200권 66門 2만 처방, 통일된 문체, 원문 나열 X, 탕제 적음'], ['陳言', '三因方', '질병을 三因으로 기입 후 원인에 따라 치료 시도, 운기학설 영향'], ['冠宗奭', '本草衍義', '治病八要 제출, 질병의 변화가 허실냉열사정내외를 벗어나지 않음, 운기학설 영향'], ['趙佶', '聖濟經', '운기학설 영향'], ['郭雍', '傷寒補亡論', '5종의 발진성 질병 감별, 5종의 斑疹 묘사, 氣中과 中風 감별, 안과수술방법 기록'], ['嚴用和', '濟生方', '질병 분류 시도, 補脾不如補腎, 明代 命門學說 발전과 관련 있음.'], ['王貺', '全生指迷方', '질병 분류 시도'], ['蘇軾, 沈括', '蘇沈良方', '질병 분류 시도'], ['許叔微', '本事方', '질병 분류 시도'], [' 許叔微', '傷寒發微論', '상한론 관련'], ['許叔微', '傷寒百證歌', '상한론 관련'], ['許叔微', '傷寒九十論', '상한론 관련'], ['成無己', '傷寒論注', '상한론 관련'], ['成無己', '傷寒明理論', '상한론 관련'], ['龐安常', '傷寒總病論', '상한론 관련'], ['韓祗和', '傷寒微旨論', '상한론 관련'], ['朱肱', '南陽活人書', '상한론 관련'], ['劉溫舒', '素問入式運氣論奧', '오운육기 전적으로 논술함'], ['?', '經寶新詳定本草', '본초서'], ['王執中', '鍼灸資生經', '침구서'], ['楊介', '存眞 圖', '도적 해부한 해부도, 양개가 교정함'], ['徐之才', '明寃寶錄', '최초의 법의학서'], ['宋慈', '洗寃錄', '법의학서,  인체 해부, 시체 검사 등 포함'], ['唐愼微', '經史證類備急本草', '=大觀本草'], ['楊士瀛', '仁齊直指方論', '동의보감 직지에 많이 인용됨'], ['錢乙', '小兒藥證直訣', '소아과'], ['陳文中', '小兒病源方論', '소아과'], ['陳文中', '小兒痘疹方論', '소아과'], ['王碩', '易簡方', '처방30, 생약30, 시중 쉽게 구할 환약10, 쉽게 치료할 수 있는 병 내용 수록'], ['張杲', '醫說', '醫話 최초 기록, 疑難雜證 치료 경험 기록'], ['陳子明', '婦人大全良方', '부인과'], ['陳子明', '外科精要', '외과']]


a=['劉完素', '柯琴', '柯琴', '柯琴', '葛乾孫', '江瓘', '高武', '高秉鈞', '高世栻', '高世栻', '顧世澄', '龔廷賢', '龔廷 賢', '龔廷賢', '戴思恭', '戴思恭', '戴天章', '陶畵', '杜思敬', '竇漢卿', '羅天益', '羅天益', '盧之頤', '樓英', '劉若金', '劉完素', '李杲', '李杲', '李杲', '李杲', '李時珍', '李時珍', '李時珍', '李中梓', '李中梓', '李中梓', '李梴', ' 馬蒔', '馬蒔', '繆希雍', '繆希雍', '方有執', '徐春甫', '薛己', '薛己', '薛己', '薛雪', '薛雪', '孫一奎', '孫一奎', '孫一奎', '孫一奎', '楊繼州', '余霖', '葉桂', '葉桂', '葉桂', '吳謙', '吳崑', '吳崑', '吳崐', '吳瑭', '吳又可', '王珪', '王肯堂', '汪機', '汪機', '汪機', '王綸', '王履', '王維德', '王淸任', '王好古', '王好古', '王好古', '王好古', '虞摶', '尤怡', '尤怡', '尤怡', '尤怡', '危亦林', '兪弁', '喻昌', '喻昌', '喻昌', '喻昌', '張介賓', '張介賓', '張介賓', ' 張介賓', '張介賓', '章楠', '張璐', '張璐', '張璐', '張元素', '張元素', '張元素', '張元素', '張元素', '張從正', '張從正', '張志聰', '齊德之', '趙良人', '趙獻可', '趙獻可', '朱橚', '周揚俊', '朱震亨', '朱震亨', '朱震亨', '朱震亨', '朱震亨', '朱震亨', '朱震亨', '朱震亨', '陳嘉謨', '陳實功', '韓懋', '滑壽', '滑壽', '滑壽', '黃元御', '黃元御', '徐大椿', '徐大椿', '徐大椿', '徐大椿', '徐大椿', '程國彭', '沈金鰲', '陳念祖', '陳念祖', '陳念祖', '陳念祖', '陳念祖', '何夢瑤', '林珮琴', '汪昻', '汪昻', '汪昻', '汪昻', '吳儀洛', '吳儀洛', '鄒澍', '傅山', '傅山', '陳士鐸', '魏之琇', '陸以湉', '余云岫', '惲鐵樵', '張山雷', '張山雷', '張山雷', '張山雷', '謝利恒', '謝利恒', '曹穎甫', '曹穎甫', '曹穎甫', ' 張錫純', '唐宗海', '唐宗海', '唐宗海', '唐宗海', '唐宗海', '唐宗海']

b=['宣明論方', '傷寒來蘇集', '傷寒附翼', '傷寒論翼', '十藥神書', '名醫類案', '鍼灸聚英', '瘍科心得集', '靈樞集註', '素 問直解', '瘍醫大全', '古今醫鑑', '萬病回春', '壽世保元', '金匱鉤玄', '推句師意', '廣溫熱論', '傷寒六書', '濟生拔萃', '鍼經指南', '內經類編', '衛生寶鑑', '本草乘雅半偈', '醫學綱目', '本草述', '素問玄機原病式', '內外傷辨惑論', '脾胃論', '蘭室秘藏', '用藥法象', '本草綱目', '瀕湖脈學', '奇經八脈考', '內經知要', '醫宗必讀', '診家正眼', '醫學入門', '黃帝內經素問注證發微', '黃帝內經靈樞註證發微', '先醒齋廣筆記', '神農本草經疏', '傷寒論條辨', '古今醫統', '內科摘要', '保嬰撮要', '薛氏醫案', '醫經原旨', '濕熱病篇', '赤水玄珠', '醫旨緖餘', '孫氏醫案', '孫氏醫書三種', '鍼灸大成', '疫病論', '臨證指南醫案', '幼科心法', '溫證論治', '醫宗金鑑', '素问注', '醫方考', '脈理', '溫病條辨', '溫疫論', '泰定養生主論', '證治準繩', '續素問抄', '鍼灸問對', '石山醫案', '明醫雜著', '醫經溯洄集', '外科證治全生集', '醫林改錯', '醫壘元戎', '陰證略例', '湯液本草', '此事難知', '醫學正傳', '傷寒貫珠集', '金匱要略心典', '金匱翼', '醫學讀書記', '世 醫得效方', '續醫說', '寓意草', '尙論篇', '傷論後篇', '醫門法律', '景岳全書', '類經', '類經圖翼', '附翼', '質疑錄', ' 醫門棒喝', '張氏醫通', '本經逢原', '診宗三昧', '醫學啓源', '珍珠囊', '藥注難經', '醫方', '臟腑標本虛實寒熱用藥式', ' 三法六門', '儒門事親', '素問集註', '外科精義', '金匱方衍義', '醫貫', '邯鄲遺稿', '普濟方', '溫熱暑疫全書', '格致餘論', '局方發揮', '傷寒辨疑', '外科精要新論', '丹溪心法', '脈因證治', '素問糾略', '金匱鈞玄', '本草蒙荃', '外科正宗', '韓氏醫通', '讀素問鈔', '難經本義', '四十經發揮', '素問懸解', '靈樞懸解', '難經經釋', '神農本草經百種錄', '醫學源流論', '傷寒類方', '醫貫砭', '醫學心悟', '雜病源流犀燭', '傷寒論淺注', '傷寒眞方歌括', '醫學實在易', '醫學三字經', '景岳新方砭', '醫碥', '類證治裁', '醫方集解', '場頭歌訣', '本草備要', '素問靈樞類纂約註', '成方切用', '本草從新', '本經疏證', '傅靑主男科', '傅靑州女科', '石室秘錄', '續名醫類案', '冷廬醫話', '靈素商兌', '群經見智錄', '本草正義', '難經回注箋正', '張潔古藏腑藥式補精', '全氏小兒藥證直訣箋正', '中國醫學源流論', '中國醫學大辭典', '經方實驗綠', '傷寒發微', '金匱發微', '醫學衷中參西錄', '血證論', '中西匯通醫經精義', '本草問答', '傷寒論淺注補正', '金匱要略淺注補正', '醫易通說']

c=[[a[i].replace(' ',''),b[i].replace(' ','')]for i in range(170)]

while 1:
    e=int(input('\n중간 or 기말? input 1 or 2 > '))-1
    if e==0:
        f=input('객관식 or 주관식? input 1 or 2 > ')
        print('')
        if f=='1':
            w=random.randrange(2)
            s=random.sample(l,5)
            five=random.randrange(5)
            print(s[five][1-w])
            x=[i[w] for i in s]
            print(x)
            while 1:
                ans=int(input('1 ~ 5 > '))-1
                if x[ans]==s[five][w]:
                    print('정답')
                    break
                else:
                    print('ㄴㄴ')
                    continue
        else:
            r=l[random.randrange(56)][2]
            print(r)
            while 1:
                ans=input()
                #print([t[1] for t in l])
                try:
                    if l[[t[1].replace(' ','') for t in l].index(ans)][2]==r:
                        print('정답')
                        break
                    else:
                        print('ㄴㄴ')
                        continue
                except ValueError:
                    print('ㄴㄴ')
                    continue
    else:
        print('')
        w=random.randrange(2)
        s=random.sample(c,5)
        five=random.randrange(5)
        print(s[five][1-w])
        x=[i[w] for i in s]
        print(x)
        while 1:
            ans=int(input('1 ~ 5 > '))-1
            if x[ans]==s[five][w]:
                print('정답')
                break
            else:
                print('ㄴㄴ')
                continue
